/*
 * @Author: wangguixing
 * @Date: 2023-03-31 09:37:36
 * @LastEditors: wangguixing
 * @LastEditTime: 2023-04-01 13:56:23
 * @FilePath: \src\utils\config\httpErrorCode.ts
 * @Description: 注明出处即可
 * Copyright 2023 wangguixing, All Rights Reserved.
 * 2023-03-31 09:37:36
 */

export default {
  100: '客户端应继续其请求',
  101: '服务器根据客户端的请求切换协议',
  200: '请求成功',
  301: '请求路径错误？',
  304: '请求资源未修改',
  305: '未使用代理',
  307: '临时重定向？',
  400: '请求语法错误',
  401: '请求未通过授权',
  403: '请求被拒绝',
  404: '请求资源不存在',
  405: '请求方法被禁用',
  410: '请求资源已删除',
  411: '请求内容长度无效',
  413: '请求实体过大',
  414: '请求路径过长',
  415: '请求格式不支持',
  416: '请求的范围无效',
  417: '请求头信息未满足',
  500: '服务器内部错误',
  502: '服务网关，代理无效',
  503: '服务不可用',
  504: '网关超时',
  505: 'HTTP版本不支持',
};
